IDEA StatiCa Open Model
RebarStirrupPattern.AddFirstStirrup Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 true: add first stirrup for this pattern. used do exclude the first stirrup in patterns > first.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool AddFirstStirrup { get; set; }
Public Property AddFirstStirrup As Boolean
	Get
	Set
public:
property bool AddFirstStirrup {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
RebarStirrupPattern Class
IdeaRS.OpenModel.Model Namespace